{
  "roles": {
    "6f7683bb-8360-461e-8013-405f1bb84c23": {
      "id": "6f7683bb-8360-461e-8013-405f1bb84c23",
      "name": "Product Marketing Manager",
      "jdIds": [],
      "createdAt": "2025-03-30T01:09:35.663Z"
    },
    "94ec3294-99c2-42a0-80d2-95336c78b09b": {
      "id": "94ec3294-99c2-42a0-80d2-95336c78b09b",
      "name": "Revenue Operations Manager",
      "jdIds": [
        "b2df4853-f232-43a4-b972-b284d57d5aab",
        "b95f197f-814a-45a8-9c62-405f6e326ea6",
        "16835287-0168-4b43-8be7-dfbcfe470681",
        "74e2cf5b-b178-4936-bc18-1c82dab43d26"
      ],
      "createdAt": "2025-03-30T10:49:32.043Z"
    },
    "727e1096-2710-47f6-9f5f-01f9a9987a05": {
      "id": "727e1096-2710-47f6-9f5f-01f9a9987a05",
      "name": "Product Manager",
      "jdIds": [
        "aa032163-f6c2-4356-b3df-c15502f2b31c",
        "1110858b-2662-4ef1-ba06-a357b76cada8"
      ],
      "createdAt": "2025-03-31T03:00:48.579Z"
    },
    "68131b13-0b5e-447b-9f19-c5f94e8c62df": {
      "id": "68131b13-0b5e-447b-9f19-c5f94e8c62df",
      "name": "Consultant",
      "jdIds": [
        "0a046b86-f503-4343-a1fd-38f69142142e"
      ],
      "createdAt": "2025-04-09T17:35:52.796Z"
    }
  },
  "jds": {
    "b2df4853-f232-43a4-b972-b284d57d5aab": {
      "id": "b2df4853-f232-43a4-b972-b284d57d5aab",
      "roleId": "94ec3294-99c2-42a0-80d2-95336c78b09b",
      "type": "pdf",
      "source": "b2df4853-f232-43a4-b972-b284d57d5aab.pdf",
      "originalFilename": "Manager, Revenue Operations | Toast | LinkedIn.pdf",
      "status": "completed",
      "analysis": "**1. Job Description:**\n\nThe Manager, Revenue Operations position at Toast in Chennai, India, involves managing a team of Collections Representatives and contributing to the company's overall collections strategy.  The role reports to the Senior Manager of Revenue Operations.  Toast aims to build a restaurant platform to help restaurants improve their businesses.\n\n\n**2. Roles and Responsibilities:**\n\n* Manage and develop a team of Collections Representatives, ensuring accurate and timely work completion according to SLAs.\n* Partner with Accounting and finance to develop and implement collections policies and procedures.\n* Proactively communicate and follow up on overdue invoices to reduce aging while maintaining positive customer relationships.\n* Collaborate with the finance team to refine and optimize Toast's collections strategy.\n* Support the review, investigation, and resolution of cases and customer escalations.\n* Ensure timely resolution of customer inquiries related to collections.\n* Collaborate with internal teams to inform customers of outstanding balances.\n* Support manual application of customer payments, refunds, and deposits as needed.\n* Prepare, analyze, and distribute reports on collections cases and accounts receivables performance with recommendations.\n* Work with Accounting and customer-facing teams to identify customer trends and adapt procedures.\n* Collaborate with other teams to identify and implement process efficiencies.\n* Consistently meet month-end close deadlines.\n* Ad hoc projects as needed.\n\n\n**3. Candidate Requirements:**\n\nNot specified in the text.\n",
      "keywords": [
        "Team Management",
        "Collections",
        "Accounts Receivable",
        "SLA",
        "Policy Development",
        "Customer Communication",
        "Data Analysis",
        "Reporting",
        "Budget Management",
        "Process Optimization",
        "Month-End Close",
        "Customer Relationship Management"
      ],
      "createdAt": "2025-03-30T21:29:31.725Z",
      "error": null,
      "analyzedAt": "2025-03-30T21:29:50.577Z"
    },
    "b95f197f-814a-45a8-9c62-405f6e326ea6": {
      "id": "b95f197f-814a-45a8-9c62-405f6e326ea6",
      "roleId": "94ec3294-99c2-42a0-80d2-95336c78b09b",
      "type": "pdf",
      "source": "b95f197f-814a-45a8-9c62-405f6e326ea6.pdf",
      "originalFilename": "Revenue Operations - HubSpot | Keka HR | LinkedIn.pdf",
      "status": "completed",
      "analysis": "**1. Job Description:**\n\nThis is a full-time, on-site position for a CRM Specialist at Keka HR in Hyderabad, India. The role involves the implementation, customization, and management of the company's HubSpot CRM system, aligning it with business goals and collaborating with sales, marketing, and customer support teams.  The specialist will leverage their expertise in HubSpot and Salesforce to streamline processes, improve data accuracy, and enhance customer experience.\n\n**2. Roles and Responsibilities:**\n\n* HubSpot Skills: Utilizing Marketing Hub, Sales Hub, Service Hub, and Ops Hub (experience across all is preferred).\n* CRM Customization:  Customizing HubSpot CRM to meet organizational needs (creating custom properties, contact records, and lead scoring models).\n* Integration: Integrating HubSpot CRM with third-party tools used by sales, marketing, and customer support teams.\n* Data Management: Maintaining data integrity through imports, cleansing, quality checks, and implementing best practices for organization and storage.\n* Automation: Developing and implementing workflow automations, email marketing automation, and lead nurturing campaigns within HubSpot CRM.\n* Reporting and Analytics: Generating custom reports and dashboards to track key performance metrics and provide actionable insights.\n* User Training: Training team members on HubSpot CRM best practices and new features.\n* Optimization: Continuously optimizing CRM processes, workflows, and configurations.\n* Technical Support: Providing technical support and troubleshooting assistance to CRM users.\n\n**3. Candidate Requirements:**\n\n* Bachelor's degree in a related field or equivalent work experience.\n* Proven experience as a HubSpot CRM specialist with in-depth knowledge of HubSpot CRM functionalities.\n* Strong understanding of CRM best practices, lead management, and marketing automation.\n* Proficiency in data management and data analysis.\n* Excellent communication and interpersonal skills.\n* Detail-oriented with a strong focus on accuracy.\n* Ability to work collaboratively in a team-oriented environment.\n* Advanced Excel skills.\n* HubSpot CRM certifications (HubSpot Academy) are a plus.\n\n",
      "keywords": [
        "HubSpot",
        "Salesforce",
        "CRM",
        "Marketing Hub",
        "Sales Hub",
        "Service Hub",
        "Ops Hub",
        "CRM Customization",
        "Data Management",
        "Data Analysis",
        "Workflow Automation",
        "Email Marketing Automation",
        "Lead Nurturing",
        "Reporting",
        "Analytics",
        "User Training",
        "Data Cleansing",
        "Lead Management",
        "Marketing Automation",
        "Integration",
        "Technical Support",
        "Advanced Excel",
        "Bachelor's Degree",
        "HubSpot CRM Certifications"
      ],
      "createdAt": "2025-03-30T21:29:37.064Z",
      "error": null,
      "analyzedAt": "2025-03-30T21:29:53.182Z"
    },
    "16835287-0168-4b43-8be7-dfbcfe470681": {
      "id": "16835287-0168-4b43-8be7-dfbcfe470681",
      "roleId": "94ec3294-99c2-42a0-80d2-95336c78b09b",
      "type": "pdf",
      "source": "16835287-0168-4b43-8be7-dfbcfe470681.pdf",
      "originalFilename": "Revenue Operations - Uniqode.pdf",
      "status": "completed",
      "analysis": "**1. Job Description:**\n\nUniqode seeks a self-sufficient Revenue Operations Manager to drive revenue-impacting initiatives and enhance operational efficiency.  The role focuses on optimizing the tech stack, refining processes, and providing strategic insights to improve Sales and Customer Success team performance.  The position requires hands-on Salesforce experience and a strong understanding of system integrations and architecture.\n\n**2. Roles and Responsibilities:**\n\n* Own the end-to-end deployment, implementation, and ongoing management of Salesforce for Sales and Customer Success teams.\n* Design and maintain a scalable systems architecture ensuring seamless integrations across CRM, data analytics, marketing automation, and customer support platforms.\n* Develop and implement automation and workflow improvements to enhance productivity and reduce manual efforts.\n* Ensure data accuracy and provide actionable insights to improve pipeline efficiency, forecast accuracy, and customer retention.\n* Work closely with Sales, CS, Marketing, and Finance teams to align processes and ensure revenue-impacting initiatives are executed effectively.\n\n**3. Candidate Requirements:**\n\n* 5+ years of experience in Revenue Operations, Sales Operations, or a related field.\n* Deep expertise in Salesforce administration, deployment, and implementation (Salesforce certification preferred).\n* Understanding of systems architecture, integrations, and data flow across revenue tech stacks (e.g., Salesforce, HubSpot, Metabase, Intercom, etc.).\n* Proven track record of driving initiatives that impact revenue, improve efficiency, and support scalability.\n* Highly analytical with the ability to translate data insights into strategic recommendations.\n* Ability to thrive in a fast-paced environment, working independently while managing multiple priorities.\n* Excellence in stakeholder management and cross-functional collaboration.\n* Experience with process automation tools and workflow optimization (Bonus).\n\n",
      "keywords": [
        "Salesforce",
        "Salesforce Administration",
        "Salesforce Deployment",
        "Salesforce Implementation",
        "Systems Architecture",
        "Integrations",
        "Data Analytics",
        "Marketing Automation",
        "Customer Support",
        "Process Optimization",
        "Workflow Improvements",
        "Data Integrity",
        "Revenue Insights",
        "Pipeline Efficiency",
        "Forecast Accuracy",
        "Customer Retention",
        "Cross-Functional Collaboration",
        "Client Communication",
        "Stakeholder Management",
        "Revenue Operations",
        "Sales Operations",
        "5+ years experience",
        "Salesforce Certification",
        "HubSpot",
        "Metabase",
        "Intercom",
        "Process Automation",
        "Budget Management"
      ],
      "createdAt": "2025-03-30T21:29:43.756Z",
      "error": null,
      "analyzedAt": "2025-03-30T21:29:54.389Z"
    },
    "aa032163-f6c2-4356-b3df-c15502f2b31c": {
      "id": "aa032163-f6c2-4356-b3df-c15502f2b31c",
      "roleId": "727e1096-2710-47f6-9f5f-01f9a9987a05",
      "type": "pdf",
      "source": "aa032163-f6c2-4356-b3df-c15502f2b31c.pdf",
      "originalFilename": "(3) LinkedIn.pdf",
      "status": "completed",
      "analysis": "**1. Job Description:**\n\nThe job is for a Product Manager at Extract Edge, a company that delivers insights from enterprise documents using an AI-powered platform.  The company helps organizations thrive in the digital world by extracting value from their data.  The role focuses on contributing to the overall product strategy and vision of Extract Edge's document AI platform.\n\n**2. Roles and Responsibilities:**\n\n* Partner with internal and external stakeholders to build the overall product strategy.\n* Help define the product vision.\n* Communicate with stakeholders, prepare project plans and release notes, conduct business-technology governance meetings.\n* Work with engineering/UX teams to provide comprehensive business solutions.\n\n**3. Candidate Requirements:**\n\n* B.Tech/MBA\n* 10 years of industry experience with a minimum of 5+ years in product management.\n* Prior experience in AI-enabled/using products.\n* Experience with NLP, Computer Vision, ML, or AI.\n* Familiarity with various generative AI models (GANs, VAEs, transformer models) and their strengths, limitations, and use cases.\n* Experience with transformer models like BERT, Contract BERT.\n* Machine Learning, AI, and language model experience, or experience in AI builder products.\n* Limited experience in data science and data engineering is a plus.\n* Scaled agile product management principles.\n",
      "keywords": [
        "Product Management",
        "Stakeholder Management",
        "Product Strategy",
        "Product Vision",
        "Project Planning",
        "Communication",
        "Business-Technology Governance",
        "Engineering",
        "UX",
        "B.Tech",
        "MBA",
        "10 Years Experience",
        "5+ Years Product Management",
        "AI",
        "NLP",
        "Computer Vision",
        "ML",
        "Generative Adversarial Networks (GANs)",
        "Variational Autoencoders (VAEs)",
        "Transformer Models",
        "BERT",
        "Contract BERT",
        "Machine Learning",
        "Language Models",
        "Data Science",
        "Data Engineering",
        "Scaled Agile",
        "Product Development"
      ],
      "createdAt": "2025-03-31T03:03:21.352Z",
      "error": null,
      "analyzedAt": "2025-03-31T03:03:32.213Z"
    },
    "1110858b-2662-4ef1-ba06-a357b76cada8": {
      "id": "1110858b-2662-4ef1-ba06-a357b76cada8",
      "roleId": "727e1096-2710-47f6-9f5f-01f9a9987a05",
      "type": "pdf",
      "source": "1110858b-2662-4ef1-ba06-a357b76cada8.pdf",
      "originalFilename": "(3) LinkedIn.pdf",
      "status": "completed",
      "analysis": "**1. Job Description:**\n\nTab Square, a market-leading provider of AI-powered technology solutions for the F&B industry, is seeking an Associate Product Manager (APM) to join their dynamic API team.  The APM will play a pivotal role in enhancing and optimizing digital products to deliver exceptional customer experiences and drive business growth.\n\n\n**2. Roles and Responsibilities:**\n\n* Collaborate with cross-functional teams to define and communicate the product vision.\n* Develop a deep understanding of customer needs and market trends, translating them into a clear product strategy.\n* Write clear and comprehensive product specifications, ensuring all technical requirements and user stories are well-documented.\n* Have a strong understanding of API integrations and work closely with developers to implement and optimize them.\n* Gather and analyze user feedback to identify areas for product improvement. Define and document detailed product requirements and user stories.\n* Collaborate closely with engineers and EM to ensure the timely and high-quality delivery of product features.\n* Conduct competitive analysis and market research to identify opportunities and threats. Stay up-to-date with emerging technologies and trends.\n* Oversee product testing and quality assurance, ensuring a seamless and bug-free user experience.\n* Monitor product KPIs and conduct data analysis to measure the success and impact of product changes. Make data-driven decisions to improve product performance.\n* Act as the central point of contact for collecting, prioritizing, and addressing user feedback and feature requests.\n* Engage and communicate effectively with POS partners to ensure smooth integration and resolve any technical issues.\n\n\n**3. Candidate Requirements:**\n\n* Bachelor's or Master's degree in Computer Science or a related field.\n* 2+ years of experience in product management with a focus on API integrations.\n* Experience working with Agile methodologies.\n* Exceptional communication and interpersonal skills.\n* Analytical mindset with proficiency in data analysis tools.\n* A customer-centric approach and a passion for creating outstanding user experiences.\n* Proficient in writing Product Requirement Documents (PRD), Functional Requirement Documents (FRD), API Requirements documents, User Stories, and assisting developers with the creation of Software Requirement Specifications or User Guides.\n* Strong knowledge of API integrations is preferred.\n\n",
      "keywords": [
        "Associate Product Manager",
        "API Integrations",
        "Product Vision",
        "Product Strategy",
        "Specification Writing",
        "User Feedback",
        "Product Improvement",
        "Agile methodologies",
        "Data Analysis",
        "Client Communication",
        "Product Requirements Documents (PRD)",
        "Functional Requirements Documents (FRD)",
        "User Stories",
        "Software Requirements Specifications",
        "User Guides",
        "Market Analysis",
        "Quality Assurance",
        "KPI Monitoring",
        "POS Partner Collaboration",
        "Bachelor's degree",
        "Master's degree",
        "Computer Science"
      ],
      "createdAt": "2025-03-31T03:04:27.529Z",
      "error": null,
      "analyzedAt": "2025-03-31T03:04:34.668Z"
    },
    "0a046b86-f503-4343-a1fd-38f69142142e": {
      "id": "0a046b86-f503-4343-a1fd-38f69142142e",
      "roleId": "68131b13-0b5e-447b-9f19-c5f94e8c62df",
      "type": "pdf",
      "source": "0a046b86-f503-4343-a1fd-38f69142142e.pdf",
      "originalFilename": "Customer and commercial strategy - - 213357.pdf",
      "status": "completed",
      "analysis": "**1. Job Description:**\n\nThis is a Consultant/Senior Consultant position in Customer & Commercial Strategy within Deloitte's USI (India Offices of the U.S.) Customer portfolio.  The role focuses on helping businesses drive growth, identify new customer segments, create omnichannel experiences, and improve commercial operations through digital transformation.  The position leverages expertise in customer insights, digital transformation, and strategic planning to deliver impactful solutions.\n\n\n**2. Roles and Responsibilities:**\n\n* Customer Analytics & Insights Generation: Conduct market research, competitive analysis, and data analysis to inform strategic decisions.\n* Customer Segmentation: Develop segmentation approaches and identify customer segments for tailored marketing, sales, and service efforts.\n* Market Entry and Growth Strategy: Assist clients in identifying new market opportunities and developing customer-led growth strategies.\n* Omnichannel Experience Strategy & Design: Design and develop multimodal customer journey strategies across physical, digital, and human experiences.\n* Digital Business Case Design and Digital Transformation: Develop business cases for digital initiatives, including cost-benefit analysis and ROI projections; define digital strategies to enhance customer engagement and streamline operations.\n* Commercial Operating Model Design: Develop future-state operating models, change management plans, and implementation roadmaps.\n* Project and Stakeholder Management: Lead and manage project teams, timelines, deliverables, and client communications.\n\n\n**3. Candidate Requirements:**\n\n* **Experience:** 2-3 years for Consultants, 4-6 years for Senior Consultants in strategy/management consulting, Big 4 consulting, or equivalent experience in Customer Strategy and Commercial Operations.\n* **Education:** MBA from a premier school (India or abroad).\n* **Skills:**\n    * Strong analytical and problem-solving skills; proficiency in Excel, SQL, Tableau, or similar.\n    * Excellent verbal and written communication skills.\n    * Knowledge of segmentation techniques (demographic, behavioral, clustering).\n    * Experience developing business cases for digital initiatives, including financial analysis and ROI projections.\n    * Strong interpersonal skills and ability to work effectively in a team environment.\n    * Willingness to travel.\n* **Preferred (but not required):**\n    * Retail/Consumer industry experience (Merchandising, Retail Floor and Space Management, Category & Assortment Planning, Omnichannel Planning; familiarity with Blue Yonder or similar applications).\n    * Experience working in non-India geographies (preferably US) and/or interacting with global stakeholders.\n\n",
      "keywords": [
        "Customer Analytics",
        "Market Research",
        "Competitive Analysis",
        "Customer Segmentation",
        "Market Entry Strategy",
        "Growth Strategy",
        "Omnichannel Strategy",
        "Digital Transformation",
        "Business Case Development",
        "ROI Projection",
        "Commercial Operating Model Design",
        "Change Management",
        "Project Management",
        "Stakeholder Management",
        "Client Communication",
        "Excel",
        "SQL",
        "Tableau",
        "Data Analysis",
        "Data Visualization",
        "MBA",
        "Strategy Consulting",
        "Problem-Solving Skills",
        "Financial Analysis",
        "2-6 years experience"
      ],
      "createdAt": "2025-04-09T17:36:00.938Z",
      "error": null,
      "analyzedAt": "2025-04-09T17:36:08.184Z"
    },
    "74e2cf5b-b178-4936-bc18-1c82dab43d26": {
      "id": "74e2cf5b-b178-4936-bc18-1c82dab43d26",
      "roleId": "94ec3294-99c2-42a0-80d2-95336c78b09b",
      "type": "pdf",
      "source": "74e2cf5b-b178-4936-bc18-1c82dab43d26.pdf",
      "originalFilename": "JD- GTM Engineer, Revenue Operations _ Remote.pdf",
      "status": "completed",
      "analysis": "**1. Job Description:**\n\nThis is a fully remote GTM Engineer position within the Revenue Operations department at Remote, a company specializing in global payroll, benefits, taxes, and compliance for remote workforces.  The role focuses on designing, managing, and scaling Remote's GTM (Go-to-Market) technology to improve sales efficiency and quota attainment.  The successful candidate will work cross-functionally, collaborating with various teams and stakeholders.\n\n**2. Roles and Responsibilities:**\n\n* Design and maintain a robust GTM tech stack.\n* Identify repetitive tasks and implement automated workflows.\n* Develop reporting mechanisms and conduct ROI analyses.\n* Ensure data accuracy and integrity across GTM systems.\n* Collaborate with Sales, Revenue Operations, and Technology teams.\n* Document and implement streamlined sales processes.\n* Analyze product offerings and customer data to create ICPs (Ideal Customer Profiles).\n* Develop and maintain automated data pipelines for prospect information.\n* Continuously measure and optimize GTM systems to align with revenue goals (pipeline generation, conversion rates, CAC, deal velocity, MRR growth, project delivery timeliness).\n* Lead quarterly innovation initiatives (AI-driven prospecting, dynamic segmentation, workflow automation).\n\n\n**3. Candidate Requirements:**\n\n* Extensive experience in a revenue operations or systems role, ideally in the B2B SaaS industry.\n* Deep hands-on experience with GTM technology stacks (CRM systems, sales engagement tools, AI-driven prospecting tools, automation platforms, advanced data enrichment solutions).\n* Lead management, multi-touch attribution, and predictive analytics experience.\n* Proven track record in leading and completing projects successfully.\n* Exceptional communication and interpersonal skills.\n* Strategic thinking with strong analytical capabilities.\n* Ability to work both autonomously and within a remote team environment.\n* Proficiency in SQL and at least one scripting language (Python, JavaScript) is preferred.\n* Experience with API integrations and data modeling is preferred.\n* Familiarity with project management tools and methodologies is a plus.\n* Ability to implement continuous improvement initiatives in sales operations.\n* A natural inclination towards transparency, collaboration, rapid iteration, and continual improvement.\n* Strong curiosity and a proven ability to meet deadlines and goals.\n\n",
      "keywords": [
        "Salesforce",
        "HubSpot",
        "Outreach",
        "Amplemarket",
        "SalesLoft",
        "Clay",
        "ChatGPT API",
        "Zapier",
        "Workato",
        "SQL",
        "Python",
        "JavaScript",
        "API integrations",
        "data modeling",
        "project management",
        "Agile",
        "GTM",
        "Revenue Operations",
        "B2B SaaS",
        "lead management",
        "multi-touch attribution",
        "predictive analytics",
        "data enrichment",
        "Client Communication",
        "Budget Management",
        "Data Analysis",
        "Project Management",
        "Sales Process Improvement",
        "Automation",
        "Reporting",
        "ROI analysis",
        "ICP definition",
        "Pipeline generation",
        "Conversion rates",
        "CAC optimization",
        "Deal velocity",
        "MRR growth",
        "communication skills",
        "analytical skills",
        "problem-solving"
      ],
      "createdAt": "2025-04-10T21:08:11.242Z",
      "error": null,
      "analyzedAt": "2025-04-10T21:08:18.476Z"
    }
  }
}